# -*- coding: utf-8 -*-
"""
Created on Wed May 23 17:36:08 2018

@author: 郭峰医生
"""
import numpy as np
import matplotlib.pyplot as  plt
import pandas as pd
from functions import *
data_total = pd.read_csv('E:\Python_work\ERdata\data_sixyears.csv')
dia_data = data_total['diagnosis']
simptom_list1 = {
'发热':'发热|发热待查|不明原因发热',
'头晕':'头晕|眩晕|头痛|头迷|脑供血',
'昏迷':'昏迷|意识丧失|意识不清|谵妄|晕厥',
'抽搐':'抽搐|癫痫|抽搐状态|癫痫发作',
'呼吸困难':'胸闷|呼吸困难|喘息|哮喘|气胸|ARDS|重症肺炎|心力衰竭|心功能不全|过度通气',
'胸痛':'胸痛|心肌梗死|心肌梗塞|心绞痛|肺梗|肺动脉栓塞|冠脉综合征|冠心病|ACS|心肌缺血|心肌供血不足',
'呕吐':'呕吐|恶心',
'急性腹痛':'腹痛|腹胀|阑尾炎|腹痛待查|胰腺炎|消化道穿孔|胆囊炎|胆管炎|肠梗阻|胃痉挛|肠痉挛|胃痛',
'消化道出血':'上消化道出血|下消化道出血|呕血|便血|胃溃疡|十二指肠溃疡|肝硬化',
'黄疸':'黄疸待查|梗阻性黄疸|胆道梗阻|溶血|肝炎',
'创伤':'外伤|骨折|摔伤|车肇事|车祸|挫伤|擦伤',
'咯血':'咯血|咳痰带血|咳血'
}
simptom_df1 = dia_count(data_total,simptom_list1)
print(simptom_df1)

plt.rcdefaults()
plt.rcParams['font.sans-serif'] = ['FangSong'] # 指定默认字体
plt.rcParams['axes.unicode_minus'] = False 
fig1 = bar_creator(simptom_df1)
print(fig1)

simptom_list2 = {'AECOPD':'AECOPD|慢阻肺|肺气肿|支气管炎|COPD|肺性脑病|II型呼吸衰竭',
'气胸':'自发性气胸|张力性气胸',
'肺动脉栓塞':'肺梗死|肺梗塞|肺动脉栓塞',
'ACS':'心肌梗死|心绞痛|急性冠脉综合征|心梗|心肌梗塞',
'心律失常':'房颤|室性心动过速|室上性心动过速|心房纤颤|心律不齐',
'心力衰竭':'心力衰竭|心功能不全|心衰',
'瓣膜病急症':'二尖瓣|主动脉|三尖瓣|肺动脉瓣',
'主动脉夹层':'主动脉夹层|夹层动脉瘤|夹层',
'消化道穿孔':'胃穿孔|肠穿孔|胆囊穿孔|消化道穿孔',
'肝病急症':'肝性脑病|急性肝炎|药物性肝炎|肝脓肿',
'胆系急症':'胆囊炎|胆管炎|胆道梗阻|胆管梗阻',
'肠梗阻':'肠梗阻|小肠梗阻|肠不全梗阻',
'胰腺炎':'急性胰腺炎|重症胰腺炎|胰腺炎',
'肠系膜血栓':'肠系膜动脉栓塞|肠系膜血栓|肠系膜静脉血栓',
'阑尾炎':'急性阑尾炎|阑尾周围脓肿|阑尾穿孔|阑尾炎',
'肾衰竭':'肾衰竭|肾功能不全',
'紫癜':'过敏性紫癜|血小板减少性紫癜|血栓性血小板减少性紫癜',
'糖尿病急症':'糖尿病酮症酸中毒|糖尿病乳酸酸中毒|糖尿病高渗',
'酸碱平衡紊乱':'酸中毒|碱中毒|低钾|高钾|低钠|高钠|低钙|高钙|低氯|高氯',
'传染病急症':'艾滋病|破伤风|狂犬病|梅毒',
'脑出血':'脑出血|蛛网膜下腔出血',
'脑梗死':'脑梗塞|脑梗死|脑栓塞|脑缺血|缺血性脑血管病',
'中枢神经系统感染':'脑炎|脑膜炎|脊髓炎',
'中毒性疾病':'百草枯中毒|有机磷中毒|药物中毒|蛇咬伤|扑热息痛|卡马西平',
'理化损伤':'中暑|电击伤|冻伤',
'休克':'失血性休克|创伤性休克|感染性休克|休克|过敏性休克',
'呼吸衰竭':'I型呼吸衰竭|II型呼吸衰竭|ARDS|呼吸衰竭',
'脓毒症':'重症感染|脓毒症|脓毒血症',
'MODS':'多脏器功能不全|多脏衰|MODS|呼吸衰竭|肝衰竭',
}
simptom_df2 = dia_count(data_total,simptom_list2)
print(simptom_df2)

plt.rcdefaults()
plt.rcParams['font.sans-serif'] = ['FangSong'] # 指定默认字体
plt.rcParams['axes.unicode_minus'] = False 
